20241206-0643/tsung.xml
<?xml version="1.0"?><tsung loglevel="notice">
	<clients>
		<client host="localhost" maxusers="32768" use_controller_vm="true"/>
	</clients>
	<servers>
		<server host="development.eba-jit2pz29.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
	</servers>
	<load>
		<arrivalphase phase="1" duration="5" unit="second">
			<users arrivalrate="1" unit="second"/>
		</arrivalphase>
		<arrivalphase phase="2" duration="5" unit="second">
			<users arrivalrate="2" unit="second"/>
		</arrivalphase>
		<arrivalphase phase="3" duration="5" unit="second">
			<users arrivalrate="4" unit="second"/>
		</arrivalphase>
		</load>
	<options>
		<option name="global_ack_timeout" value="4000"/>
		<option name="file_server" id="userlist" value="example_userlist.csv"/>
	</options>
	<sessions>
		<session name="example" type="ts_http" weight="1">
			<request>
				<http method="GET" url="/login" version="1.1">
					<http_header name="Accept-Encoding" value="gzip, deflate"/>
				</http>
			</request>
			<request>
				<dyn_variable name="authenticity_token"/>
				<http url="/login" version="1.1" method="GET">
					<http_header name="Accept-Encoding" value="gzip, deflate"/>
				</http>
			</request>
			<setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                          http_uri:encode(Val) end.">
				<var name="encoded_authenticity_token"/>
			</setdynvars>
			<transaction name="SIGN_IN">
				<setdynvars sourcetype="file" fileid="userlist" delimiter="," order="iter">
					<var name="random_user_number"/>
				</setdynvars>
				<thinktime value="1" random="false"/>
				<request subst="true">
					<http url="/login" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;session%5Buser_name%5D=user1&amp;session%5Bpassword%5D=password&amp;commit=Log+In" content_type="application/x-www-form-urlencoded"/>
				</request>
			</transaction>
			<request>
				<dyn_variable name="authenticity_token"/>
				<http url="/groups/1/posts/new" version="1.1" method="GET">
					<http_header name="Accept-Encoding" value="gzip, deflate"/>
				</http>
			</request>
			<thinktime random="true" min="4" max="10"/>
			<setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                       {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                       http_uri:encode(Val) end.">
				<var name="encoded_post_authenticity_token"/>
			</setdynvars>
			<transaction name="CREATE_POST">
				<thinktime value="4" random="false"/>
				<request subst="true">
					<http url="/groups/1/posts" method="POST" version="1.1" contents="authenticity_token=%%_encoded_post_authenticity_token%%&amp;post%5Bpost_name%5D=foo&amp;post%5Bbody%5B=blahblahblah&amp;commit=Create+Post" content_type="application/x-www-form-urlencoded"/>
				</request>
			</transaction>
      <transaction name="CREATE_COMMENT">
        <request>
          <dyn_variable name="authenticity_token"/>
          <http url="/groups/1/posts/1" version="1.1" method="GET">
            <http_header name="Accept-Encoding" value="gzip, deflate"/>
          </http>
        </request>
        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         http_uri:encode(Val) end.">
          <var name="encoded_comment_authenticity_token"/>
        </setdynvars>
        <thinktime value="4" random="false"/>
        <request subst="true">
					<http url="/groups/1/posts/1/comments" method="POST" version="1.1" contents="authenticity_token=%%_encoded_comment_authenticity_token%%&amp;comment%5Bbody%5D=blahblahblah&amp;commit=Post+Comment" content_type="application/x-www-form-urlencoded"/>
				</request>
      </transaction>
		</session>
	</sessions>
</tsung>